### Data Exploration & Leading

In [55]:
import pandas as pd
from sqlalchemy import create_engine
import urllib.parse

In [82]:
df = pd.read_csv("E:/Data_analyst_projects/Walmart.csv")

In [83]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [84]:
df.shape

(10051, 11)

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [86]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [87]:
df.dropna(inplace=True)
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [88]:
df.duplicated().sum()

np.int64(51)

In [89]:
df.drop_duplicates(inplace=True)
df.duplicated().sum()

np.int64(0)

In [90]:
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [91]:
df["unit_price"] = df["unit_price"].str.replace("$"," ").astype(float)
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [92]:
df.columns = df.columns.str.lower()
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [93]:
df.describe()

         invoice_id   unit_price     quantity       rating  profit_margin
count   9969.000000  9969.000000  9969.000000  9969.000000    9969.000000
mean    5010.116561    50.622142     2.355602     5.828839       0.393744
std     2886.217349    21.203766     1.605455     1.763723       0.090659
min        1.000000    10.080000     1.000000     3.000000       0.180000
25%     2524.000000    32.000000     1.000000     4.000000       0.330000
50%     5016.000000    51.000000     2.000000     6.000000       0.330000
75%     7508.000000    69.000000     3.000000     7.000000       0.480000
max    10000.000000    99.960000    10.000000    10.000000       0.570000

### Feature Engineering

In [94]:
df["total_sales"] = df["unit_price"] * df["quantity"]

In [95]:
df["profit"] = df["unit_price"] * df["quantity"] * df["profit_margin"]

### Connecting with mysql database

In [96]:
password = 'Kumkum1704@04'

encoded_password = urllib.parse.quote_plus(password)

engine = create_engine(f"mysql+mysqlconnector://root:{encoded_password}@localhost:3306/walmart_db")

try:
    engine
    print("Connection Successed to mysql")
except:
    print("Unable to Connect")

Connection Successed to mysql

In [97]:
df.to_sql(name='walmart', con = engine, if_exists = 'replace', index=False)

9969

In [98]:
df.shape

(9969, 13)

In [99]:
df.to_csv("E:/Data_analyst_projects/walmart2.csv",index=False)